<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f4aff3056775bbee2a08e791d5eecbc77d0baa4436e9e80da166b74b70b4d286","plan_job_ref":"Job Terraform plan #18 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124845239","plan_out_hash":"de14c0c1408000fbda6b673a2d1ab856f63cf65d1635a669039a286b503bafc2","plan_hash":"4a75a86edf77abbe1fb0917a4181d9745c37c48cc12d4a625cba587ba3688c13","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # yandex_function.yandex-reverse-image-search will be created
+   resource "yandex_function" "yandex-reverse-image-search" {
+       created_at        = (known after apply)
+       entrypoint        = "function.handler"
+       execution_timeout = "10"
+       folder_id         = (known after apply)
+       id                = (known after apply)
+       image_size        = (known after apply)
+       loggroup_id       = (known after apply)
+       memory            = 128
+       name              = "yandex-reverse-image-search"
+       runtime           = "nodejs18"
+       tags              = (known after apply)
+       user_hash         = "9e0d54d9fd3589f28056d88168380c998cf30695f2a9ec743bd3d3ea1f4ba727"
+       version           = (known after apply)

+       content {
+           zip_filename = "./yandex-reverse-image-search.zip"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #7](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124866882)